[
    {
        "title": "What is a computer",
        "subtitle": "Computer is an electronic device that processes data and performs a wide range of tasks by following a set of instructions, typically referred to as programs or software. It can execute complex calculations, store and retrieve data, and perform tasks like word processing, gaming, web browsing, data analysis, and much more.",
        "image_url": "https://images.unsplash.com/photo-1587831990711-23ca6441447b?q=80&w=3131&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "detail": "A computer is made up of hardware (physical components) and software (the programs that run on it). The central processing unit (CPU) is often called the brain of the computer, as it performs most of the processing. Computers use input devices like keyboards and mice to receive commands from users, while output devices like monitors and printers allow users to see or hear results. Computers have revolutionized modern life, making tasks like communication, research, and entertainment faster and more accessible. They can be as small as a smartphone or as large as powerful supercomputers used for scientific research."
    },
    {
      "title": "What is a machine learning",
        "subtitle": "Machine learning is a type of Artificial Intelligence that trains algorithms on large datasets to recognize patterns, learn from experience, and make predictions or decisions without being explicitly programmed for every task.",
        "image_url": "https://images.unsplash.com/photo-1620712943543-bcc4688e7485?q=80&w=1530&auto=format&fit=crop&ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        "detail": "Machine learning is a subset of artificial intelligence (AI) focused on creating algorithms that can learn and improve over time. These algorithms are trained using large datasets to detect patterns and make predictions or decisions based on that data. For example, a machine learning model might be trained to recognize images of cats and dogs by being fed thousands of pictures labeled as such. Over time, the algorithm improves its ability to distinguish between the two animals. Common applications of machine learning include email filtering, speech recognition, and recommendation systems (like the ones used by Netflix or Spotify). There are different types of machine learning, including supervised learning (where the model is trained with labeled data) and unsupervised learning (where the model finds patterns in unlabeled data)."
    },  
    {
        "title": "What is an artificial intelligence",
        "subtitle": "Artificial intelligence is the simulation of human intelligence in machines that are programmed to think and learn like humans. AI systems can perform tasks that typically require human intelligence, such as visual perception, speech recognition, decision-making, and language translation.",
        "image_url": "https://media.licdn.com/dms/image/v2/D5612AQGPAWjwV6d5VQ/article-cover_image-shrink_720_1280/article-cover_image-shrink_720_1280/0/1704213035509?e=2147483647&v=beta&t=hfyEB-HTJSaOVzv4wlvmnqAgqEko_9_Rf4onikFSHHo",
        "detail": "Artificial Intelligence (AI) involves creating machines or software that can perform tasks that usually require human intelligence. These tasks can range from simple things like recognizing voices in virtual assistants (like Siri or Alexa) to more complex tasks like diagnosing diseases or driving cars autonomously. AI systems are designed to analyze large amounts of data, learn from it, and make decisions or predictions. AI is a broad field that includes various subfields like machine learning, natural language processing (NLP), robotics, and computer vision. AI is used in many industries, from healthcare (where it helps doctors in diagnosing diseases) to entertainment (where it is used to recommend movies or music). Some AI systems are also capable of adapting to new situations or learning from their mistakes, which makes them"
    }
]